# Константы для категорий расходов
EXPENSE_CATEGORIES = [
	"Обязательные",
	"Спорт",
	"Бытовые",
	"Резерв",
    "Еда",
    "Транспорт",
    "Развлечения",
    "Здоровье",
    "Кредиты",
    "Другое"
]

# Цвета для категорий (RGB значения от 0 до 1)
CATEGORY_COLORS = {
	"Обязательные": {"red": 1.0, "green": 0.8, "blue": 0.8},
	"Спорт": {"red": 0.8, "green": 1.0, "blue": 0.8},
	"Бытовые": {"red": 0.8, "green": 0.8, "blue": 1.0},
	"Резерв": {"red": 0.9, "green": 0.9, "blue": 0.9},
    "Еда": {"red": 0.8, "green": 1.0, "blue": 0.8},
    "Транспорт": {"red": 0.8, "green": 0.9, "blue": 1.0},
    "Развлечения": {"red": 1.0, "green": 1.0, "blue": 0.8},
    "Здоровье": {"red": 1.0, "green": 0.8, "blue": 0.8},
    "Кредиты": {"red": 0.9, "green": 0.9, "blue": 0.9},
    "Другое": {"red": 1.0, "green": 0.9, "blue": 0.7}
}